# Creation time: 2022/6/13 10:13
# The author: Tiger_YC
"""
                   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
             佛祖保佑       永无BUG
"""


class Config:
    """
    全局可控 配置
    """
    # 脚本日志输出位置 文件名:
    log_path = "static_files/logs/MachineLog.log"

    # 消费图片路径 注意 /结尾
    xf_path = "static_files/xf/"

    # 人脸，上传、保存路径  注意 /结尾
    rl_path = "static_files/images/"

    # 下发人脸等 脚本运行检查轮询时间  单位 秒
    poll_time: int = 30

    # 下发人脸图片获取接口
    pic_url = "http://172.17.18.2:18080"
    # pic_url = "http://172.17.18.200:8008"
